Homework/AbstractAlgebra/HW1/MATH415Hw1.tex
% Created 2019-01-16 Wed 16:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{Parker Gabel}
\date{\today}
\title{Math 415 Homework 1}
\hypersetup{
 pdfauthor={Parker Gabel},
 pdftitle={Math 415 Homework 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Find all the zero divisors of \(\mathbb{Z}/20\mathbb{Z}\).}
\label{sec:orgfcafc88}
Notice that the additive identity of \(\mathbb{Z}/20\mathbb{Z}\) is \(\mathbb{Z} = 1 \mathbb{Z}\). 
Therefore a zero divisor is any a,b \(\in\) \mathbb{Z} such that ab \(\equiv\) 1 mod 20. This is the set of all integers that are coprime to 20 or \{[1], [3], [7], [9], [11], [13], [17], [19]\}. ([x] means the equivalence class of x modulo 20)

\section{Determine U(\(\mathbb{Z}[i]\)) where \(\mathbb{Z}[i]\) \(\subseteq\) \(\mathbb{C}\) is the ring of Gaussian Integer.}
\label{sec:orgcd16b14}
\paragraph{}
Notice 1 \(\in\) \(\mathbb{Z}[i]\) is its own inverse so 1 \(\in\) U(\(\mathbb{Z}[i]\)). Likewise -1 \(\in\) \(\mathbb{Z}[i]\) is its own inverse so -1 \(\in\) U(\mathbb{Z}[i]).
Notice \(i(-i) = 1 = (-i)i\) so i, -i \(\in\) U(\(\mathbb{Z}[i]\)). \par 
I claim there are no more units in the Gaussian Integers.
Assume x \(\in\) U(\(\mathbb{Z}[i]\)) and x \(\ne\) 1,-1,i,-i. \par
So x = a + bi and there exists a y = \(\alpha\) + \(\beta\) i such that xy = 1. \par

\section{Let G be a group and let R be a ring.  We denote by RG the set of all functions f: G \(\to\) R whose support \{x \(\in\) G | f(x) \(\ne\) 0\} is finite.  Note that if G is finite then this condition is automatically satisfied.}
\label{sec:org355168e}
\subsection{Show that RG is a ring under the operations defined by \[(f+g)(x) =f(x) +g(x)\]    \[(fg)(x) =\sum_{y\in G} f(y)g(y^{-1}x) \]for all f,g \(\in\) RG and x \(\in\) G.  Note the sum on the right makes sense as it has only finitely many non-zero terms. The product just defined is usually called the convolutional product and we call RG the group ring.}
\label{sec:org0b16156}
\paragraph{}
Let a,b,c \(\in\) RG
\subsubsection{(a + b)(x) = (b + a)(x)}
\label{sec:org3f1f499}
\paragraph{}
Consider (a + b)(x) = a(x) + b(x) = b(x) + a(x) = (b + a)(x).
\subsubsection{(a + b)(x) + c(x) = a(x) + (b + c)(x)}
\label{sec:org61abe58}
\paragraph{}
Consider (a + b)(x) + c(x) = a(x) + b(x) + c(x) = a(x) + (b + c)(x). 
\subsubsection{There is an additive identity.}
\label{sec:orge01e368}
\paragraph{}
Consider i: G \(\to\) R defined by i(x) = 0. Notice this fuctions support is empty so it is finite. Also for all y \(\in\) RG, (y + i)(x) = y(x) + 0 = y(x).
So i is the additive identity of RG.
\subsubsection{There is an element -a \(\in\) RG such that (a + (-a))(x) = 0.}
\label{sec:org25ac212}
\paragraph{}
Consider the function \(\alpha\): G \(\to\) R defined by \(\alpha\)(x) = -(a(x)). As G is a group any a(x) will have an additive inverse so this is possible. Also \(\alpha\) has the same support as a. So (a + \(\alpha\))(x) = a(x) + \(\alpha\)(x) = a(x) + (-a(x)) = 0. So this is -a \(\in\) RG.
\subsubsection{a(x)(bc)(x) = (ab)(x)c(x)}
\label{sec:org7550bbb}
\paragraph{}
Consider \[a(x)(bc)(x) = a(x)\sum_{y\in G} b(y)c(y^-1 x)\]
\end{document}